In [1]:
import pandas as pd

In [2]:
import numpy as np
import random
import matplotlib.pyplot as plt

In [3]:
pd.__version__  #current version of pandas in system

'1.4.4'

In [12]:
lt=[1,2,-3,6.2,"hii"]
print(lt)

[1, 2, -3, 6.2, 'hii']

In [13]:
s1=pd.Series(lt)  #series created..series is a data type in pandas which is in labelled format..kinda 1d indices array
print(s1)    #1st column indices and 2nd column data values..it has been called as object data type coz it has
#integer as well as string value..agar sirf integer hota to dtype int32

0      1
1      2
2     -3
3    6.2
4    hii
dtype: object

In [14]:
type(s1)   #type of series

pandas.core.series.Series

In [16]:
s2=pd.Series([1,2,3,4])  #always remember to spell series as capital 'S',avoid syntax error
print(s2)

0    1
1    2
2    3
3    4
dtype: int64

In [18]:
empty_s=pd.Series([])  #to create empty series
print(empty_s)

Series([], dtype: float64)

C:\Users\KIIT\AppData\Local\Temp\ipykernel_13172\2823983443.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  empty_s=pd.Series([])

In [19]:
s3=pd.Series([1,2,3,4],index=['a','b','c','d'])  #we can give indices manually like this

In [20]:
print(s3) #total indices should not be less or more than total data..exact same ..agar 4 data h to 4 indices do

a    1
b    2
c    3
d    4
dtype: int64

In [23]:
s3=pd.Series([1,2,3,4],index=['a','b','c','d'],dtype=float)  #converted into float/if string dtype=str
print(s3)

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [24]:
s3=pd.Series([1,2,3,4],index=['a','b','c','d'],dtype=float,name='practice set') #giving name to column created
print(s3)

a    1.0
b    2.0
c    3.0
d    4.0
Name: practice set, dtype: float64

In [25]:
s4=pd.Series(0.5)  #for creating single scalar element
print(s4)

0    0.5
dtype: float64

In [26]:
s4=pd.Series(0.5,index=[1,2,3])  #for creating single scalar element at all given index 
print(s4)

1    0.5
2    0.5
3    0.5
dtype: float64

In [27]:
s5=pd.Series({'a':1,'b':2,'c':3})  #creating series by dictionary where keys are indices and data values are values
print(s5)  #dictionary is k:v key:value

a    1
b    2
c    3
dtype: int64

In [28]:
s6=pd.Series([1,2,3,4])

In [29]:
print(s6)

0    1
1    2
2    3
3    4
dtype: int64

In [30]:
s6[2]  #accessing 2nd index of s6

3

In [32]:
s6[0:3]  #slicing ..start index:end-1th index..exclude the given one

0    1
1    2
2    3
dtype: int64

In [34]:
max(s6)  #max in s6

4

In [35]:
s6

0    1
1    2
2    3
3    4
dtype: int64

In [36]:
min(s6)   #min

1

In [39]:
s6[s6>2]  #s6 me 2nd index se greater

2    3
3    4
dtype: int64

In [40]:
s6

0    1
1    2
2    3
3    4
dtype: int64

In [41]:
s0=pd.Series([1,2,3,4,5])

In [42]:
s6+s0  #sum of s6 and s0 where indices will be common and data values add honge..NaN mtlb uss index me koi value nahi thi
#NaN = not a number

0    2.0
1    4.0
2    6.0
3    8.0
4    NaN
dtype: float64

In [43]:
s6*s0  #multiply

0     1.0
1     4.0
2     9.0
3    16.0
4     NaN
dtype: float64

In [44]:
s6/s0  #division

0    1.0
1    1.0
2    1.0
3    1.0
4    NaN
dtype: float64

In [45]:
s6-s0 #subtraction

0    0.0
1    0.0
2    0.0
3    0.0
4    NaN
dtype: float64

In [46]:
import pandas as pd
import numpy as np
import random
import matplotlib.pyplot as plt

In [47]:
#data frame...2nd type of data type in panda after Series
#its a 2d,size-mutable,tabular data type with labelled axis(row and column)

In [48]:
df=pd.DataFrame()  #created empty data frame..rows and columns are empty
print(df)

Empty DataFrame
Columns: []
Index: []

In [49]:
lt=[1,2,3,4]
print(lt)

[1, 2, 3, 4]

In [50]:
df=pd.DataFrame(lt) #df using list

In [51]:
print(df)

   0
0  1
1  2
2  3
3  4

In [52]:
df

   0
0  1
1  2
2  3
3  4

In [53]:
ls=[[1,2,3],[4,5,6],[7,8,9]]  #df of 2d array
df1=pd.DataFrame(ls)

In [54]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [61]:
dict1={'ID':[1,2,3],'Name':["Yuvraj","Alisha","Ben"],'Work':["IT","ECom","Sales"]}
df2=pd.DataFrame(dict1)  #keys are ID,Name,Work and values are RHSs
(df2)  #keys gonna print rowwise and values columnwise

   ID    Name   Work
0   1  Yuvraj     IT
1   2  Alisha   ECom
2   3     Ben  Sales

In [69]:
lsdc=[{'Yuvraj':1,'Samar':2},{'Yuvraj':3,'Samar':4}] #DataFrame using list of dictionaries

In [67]:
print(lsdc)

[{'Yuvraj': 1}, {'Samar': 2}]

In [70]:
pd.DataFrame(lsdc)

   Yuvraj  Samar
0       1      2
1       3      4

In [72]:
dics={'ID':pd.Series([1,2,3]),'Name':pd.Series(["Yuvraj","Karan","Shivani"])}
print(dics)  #creating DF using Dictionary of Series

{'ID': 0    1
1    2
2    3
dtype: int64, 'Name': 0     Yuvraj
1      Karan
2    Shivani
dtype: object}

In [73]:
pd.DataFrame(dics)

   ID     Name
0   1   Yuvraj
1   2    Karan
2   3  Shivani